zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxSpu_regdef.h
/** \brief Scalar Multiplication Operand */
typedef struct _Ifx_SPU_SCALARMULT_Bits
{
    Ifx_UReg_32Bit OPERAND:32;        /**< \brief [31:0] Operand for Scaling (rw) */
} Ifx_SPU_SCALARMULT_Bits;

/** \brief Safety Mechanism Control Functions */
typedef struct _Ifx_SPU_SMCTRL_Bits
{
    Ifx_UReg_32Bit CTRLCRCEN:2;       /**< \brief [1:0] Control CRC Enable (rw) */
    Ifx_UReg_32Bit DATACRCEN:2;       /**< \brief [3:2] Data CRC Enable (rw) */
    Ifx_UReg_32Bit REGCRCEN:2;        /**< \brief [5:4] Register CRC Enable (rw) */
    Ifx_UReg_32Bit RIFCRC:2;          /**< \brief [7:6] RIF Data CRC Check Enable (rw) */
    Ifx_UReg_32Bit BPCRC:2;           /**< \brief [9:8] Bypass Data CRC Check Enable (rw) */
    Ifx_UReg_32Bit RMTAERR:2;         /**< \brief [11:10] Radar Memory Access Address Error Enable (rw) */
    Ifx_UReg_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_SPU_SMCTRL_Bits;

/** \brief Safety Mechanism Status */
typedef struct _Ifx_SPU_SMSTAT_Bits
{
    Ifx_UReg_32Bit SMSTAT:6;          /**< \brief [5:0] Safety Mechanism Status (rh) */
    Ifx_UReg_32Bit reserved_6:2;      /**< \brief [7:6] \internal Reserved */
    Ifx_UReg_32Bit SMSCLR:1;          /**< \brief [8:8] Clear Safety Mechanism Status (w) */
    Ifx_UReg_32Bit reserved_9:7;      /**< \brief [15:9] \internal Reserved */
    Ifx_UReg_32Bit SMCTRLSTS:1;       /**< \brief [16:16] Safety Machanism Control Status (rh) */
    Ifx_UReg_32Bit SMCTRLCLR:1;       /**< \brief [17:17] Clear SMCTRL Status Flag (w) */
    Ifx_UReg_32Bit reserved_18:14;    /**< \brief [31:18] \internal Reserved */
} Ifx_SPU_SMSTAT_Bits;

/** \brief Safety Mechanism Control Functions (User) */
typedef struct _Ifx_SPU_SMUSER_Bits
{
    Ifx_UReg_32Bit CINIT:2;           /**< \brief [1:0] Monitor CRC Unit Initialise (rw) */
    Ifx_UReg_32Bit reserved_2:14;     /**< \brief [15:2] \internal Reserved */
    Ifx_UReg_32Bit RIFCRCTST:2;       /**< \brief [17:16] Test RIF CRC (rw) */
    Ifx_UReg_32Bit BPCRCTST:2;        /**< \brief [19:18] Test Bypass CRC (rw) */
    Ifx_UReg_32Bit RMCTRLTST:2;       /**< \brief [21:20] Test Radar Memory Control (rw) */
    Ifx_UReg_32Bit RDECCTST:2;        /**< \brief [23:22] Test EMEM Read Data ECC (rw) */
    Ifx_UReg_32Bit RMTAERRTST:2;      /**< \brief [25:24] Test Radar Memory Access Address Error (rw) */
    Ifx_UReg_32Bit reserved_26:6;     /**< \brief [31:26] \internal Reserved */
} Ifx_SPU_SMUSER_Bits;

/** \brief Status and Reporting */
typedef struct _Ifx_SPU_STAT_Bits
{
    Ifx_UReg_32Bit ERRSTS:1;          /**< \brief [0:0] Error Status (rw) */
    Ifx_UReg_32Bit ERRCLR:1;          /**< \brief [1:1] Error Clear (w) */
    Ifx_UReg_32Bit ERRMSK:6;          /**< \brief [7:2] Error Mask (rw) */
    Ifx_UReg_32Bit INTSTS:1;          /**< \brief [8:8] Interrupt Status (rw) */
    Ifx_UReg_32Bit INTCLR:1;          /**< \brief [9:9] Interrupt Clear (w) */
    Ifx_UReg_32Bit INTMSK:6;          /**< \brief [15:10] Interrupt Mask (rw) */
    Ifx_UReg_32Bit OVRRN:3;           /**< \brief [18:16] Overrun (rwh) */
    Ifx_UReg_32Bit reserved_19:1;     /**< \brief [19:19] \internal Reserved */
    Ifx_UReg_32Bit ERRTRG:6;          /**< \brief [25:20] Interrupt Trigger (rh) */
    Ifx_UReg_32Bit INTTRG:6;          /**< \brief [31:26] Interrupt Trigger (rh) */
} Ifx_SPU_STAT_Bits;

/** \brief Output Buffer Memory Write Count */
typedef struct _Ifx_SPU_ULDRCNT_Bits
{
    Ifx_UReg_32Bit CNT:20;            /**< \brief [19:0] Access Count (rh) */
    Ifx_UReg_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_SPU_ULDRCNT_Bits;

/** \brief User OCDS Trace Control */
typedef struct _Ifx_SPU_USROTC_Bits
{
    Ifx_UReg_32Bit reserved_0:16;     /**< \brief [15:0] \internal Reserved */
    Ifx_UReg_32Bit TRSCTRL:8;         /**< \brief [23:16] Trace Control (rwh) */
    Ifx_UReg_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_SPU_USROTC_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_spu_Registers_union
 * \{   */
/** \brief Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_ACCEN0_Bits B;            /**< \brief Bitfield access */
} Ifx_SPU_ACCEN0;

/** \brief Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_ACCEN1_Bits B;            /**< \brief Bitfield access */
} Ifx_SPU_ACCEN1;

/** \brief Spare Configuration Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_ACFG2_Bits B;             /**< \brief Bitfield access */
} Ifx_SPU_ACFG2;

/** \brief Antenna Offset   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_BE_ANTOFST_Bits B;        /**< \brief Bitfield access */
} Ifx_SPU_BE_ANTOFST;

/** \brief CFAR Module Control   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_BE_CFARCTRL_Bits B;       /**< \brief Bitfield access */
} Ifx_SPU_BE_CFARCTRL;

/** \brief Loader Configuration   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_BE_LDR_CONF_Bits B;       /**< \brief Bitfield access */
} Ifx_SPU_BE_LDR_CONF;

/** \brief Loader Configuration Extended   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SPU_BE_LDR_CONF2_Bits B;      /**< \brief Bitfield access */
} Ifx_SPU_BE_LDR_CONF2;

